app/controllers/posts_controller.rb

  def index

  	#all posts are being looped and rendered by view
  	#odering all posts in chrono order
  	@posts = Post.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC

  def update
  	@post = Post.find(params[:id])


  	#redirect to post show page, else render edit form
  	if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "this works"], ["body", "i hope"], ["updated_at", "2016-01-07 23:09:03.416766"], ["id", 1]]